[
 {
     "name":"Terrans",
     "description":"The Terrans are a fictional future version of humanity in the StarCraft series. The Terrans are the most splintered of the StarCraft species, consisting of multiple factions and nations that not only fight the other races but each other as well. Consideredan adaptive and mobile species 'too stubborn or stupid to know when to give up' when faced with existential threat, the Terrans are noted in the lore of the series for their ability to quickly access and drain a planet's resources. The Terranshave been dedicated a full campaign in each real-time strategy video game installment to date, and are defined in-game by their specialization of units and tactics of defense, tanking, mobility, and overwhelming concentrated firepower; they are the only faction to not field any 'melee unit'. In the series' storyline, the Terrans are usually displayed as being caught in the conflict's crossfire between the Protoss and Zerg; they are forced to fight superior alien powers on two-frontwar at tremendous technological and evolutionary disadvantage, each determined to destroy the other, while also dealing with frequent internal strife, civil wars and revolutions.",
     "image_source":"https://upload.wikimedia.org/wikipedia/en/f/fd/Tychus_Findlay_%28StarCraft%29.png"
 },
 {
     "name":"Zergs",
     "description":"The Zerg Swarm is a species of xenomorphic 'hyper-evolutionary' superorganisms; they are the overriding antagonists of the StarCraft series. Unlike the Protoss and the Terrans, the Zerg are not 'tool-makers', lacking technological inclination; instead, they 'force-evolve' genetic traits by directed mutation in order to match such technology. Operating as a hive mind-linked 'chain of command', the Zerg strive for 'genetic perfection' by assimilating the unique genetic adaptations of 'worthy' species into their own gene pool, creating numerous variations of specialised strains of Zerg gifted with unique adaptations. Despite being notoriously cunning and ruthlessly efficient, the majority of Zerg species have low intelligence; becoming mindless beasts if not connected to a 'hive-cluster' or a 'command entity'. As with the other two primary races, the Zerg are the subject of a full campaign in each of the series' real-time strategy video games. Zerg units are designed to be cost-efficient and fast to produce, encouraging players to overwhelm their opponents with sheer numerical advantage. Since the release of StarCraft the Zerg have become a video gaming icon, described by PC Gamer UK as 'the best race in strategy history'. The term 'Zerg Rush' or 'zerging' has entered video gaming lexiconto describe sacrificing economic development in favour of using many low-cost fast/weak units to rush and overwhelm an enemy by attrition or sheer numbers. The tactic is infamous; most experienced real-time strategy players are familiar with the tactic in one form or another.",
     "image_source":"https://upload.wikimedia.org/wikipedia/en/b/be/Hydralisk_%28StarCraft%29.png"
 },
 {
     "name":"Protoss",
     "description":" The Protoss are a sapient humanoid species in the StarCraft series, originating from Aiur, a planet on the fringe of the galaxy. They consist of four societies, the conservative Khalai Protoss, the exiled Nerazim, the abandoned Purifiers and the sadisticTal'darim. The Protoss are depicted as a physically strong species with psionic abilities. The Protoss are the most technologically advanced race of the series and have been dedicated a full campaign in each installment to date.",
     "image_source":"https://upload.wikimedia.org/wikipedia/en/8/8f/Zealot_%28StarCraft%29.png"
 } 
]